{
    "template_name": "Amazon Sponsored Product Campaign Playbook",
    "sections": [
      {
        "section_name": "Campaign Planning",
        "questions": [
          {
            "category": "Objective and Goals",
            "questions": [
              "What is the primary objective of this Sponsored Product campaign (e.g., drive sales, launch a new product, improve ranking)?",
              "What is the target ACoS or ROAS for this campaign?",
              "Are there specific products, categories, or competitors to focus on?"
            ]
          },
          {
            "category": "Budgeting",
            "questions": [
              "What is the total budget for this campaign?",
              "What is the daily budget allocation?",
              "Is there flexibility to increase the budget based on performance?"
            ]
          },
          {
            "category": "Product Selection",
            "questions": [
              "Which products will be advertised in this campaign?",
              "Are the selected products fully optimized (e.g., high-quality images, detailed descriptions, competitive pricing)?",
              "What is the current Best Seller Rank (BSR) and sales velocity of these products?"
            ]
          }
        ]
      },
      {
        "section_name": "Campaign Setup",
        "questions": [
          {
            "category": "Campaign Type and Targeting",
            "questions": [
              "Is this campaign using automatic targeting, manual targeting, or both?",
              "If automatic targeting, which match types will be enabled (e.g., close match, loose match, substitutes, complements)?",
              "If manual targeting, what are the primary keywords and ASINs to target?"
            ]
          },
          {
            "category": "Ad Group Structure",
            "questions": [
              "How many ad groups will be created for this campaign?",
              "What is the focus of each ad group (e.g., keywords, ASIN targeting, product groups)?",
              "How will products be grouped within the ad groups for better targeting and budget allocation?"
            ]
          },
          {
            "category": "Keyword Strategy",
            "questions": [
              "What keywords will be targeted, and how were they identified (e.g., Amazon auto-suggestions, competitor research, keyword tools)?",
              "What match types will be used for the keywords (e.g., broad, phrase, exact)?",
              "Are there any negative keywords that should be excluded to improve relevance?"
            ]
          }
        ]
      },
      {
        "section_name": "Creative Assets",
        "questions": [
          {
            "category": "Ad Content",
            "questions": [
              "Are the product titles and descriptions optimized for the targeted keywords?",
              "Do the images used on the product detail page meet Amazon's quality standards and showcase the product effectively?",
              "Are the bullet points and A+ content designed to answer customer questions and highlight key features?"
            ]
          },
          {
            "category": "Landing Page Optimization",
            "questions": [
              "Is the product detail page optimized to convert traffic into sales?",
              "Does the page include relevant keywords and persuasive content?",
              "Are there any customer reviews or ratings that could be improved before launching the campaign?"
            ]
          }
        ]
      },
      {
        "section_name": "Campaign Management",
        "questions": [
          {
            "category": "Bidding Strategy",
            "questions": [
              "What is the initial bid amount for each target (e.g., competitive or conservative)?",
              "Will dynamic bidding strategies (e.g., up and down, down only) be enabled?",
              "Are there specific keywords or targets that warrant higher bids due to expected performance?"
            ]
          },
          {
            "category": "Performance Monitoring",
            "questions": [
              "How frequently will the campaign performance be reviewed (e.g., daily, weekly)?",
              "What metrics will be tracked to evaluate success (e.g., impressions, clicks, CTR, CPC, ACoS)?",
              "What tools or reports will be used to monitor performance (e.g., Amazon Campaign Manager, third-party analytics tools)?"
            ]
          },
          {
            "category": "Optimization Plan",
            "questions": [
              "How will bids and budgets be adjusted based on performance data?",
              "Will additional keywords or ASINs be added as the campaign progresses?",
              "What criteria will be used to pause underperforming targets or ad groups?"
            ]
          }
        ]
      },
      {
        "section_name": "Post-Campaign Analysis",
        "questions": [
          {
            "category": "Performance Review",
            "questions": [
              "Did the campaign achieve its target ACoS or ROAS?",
              "What were the top-performing keywords, ASINs, or ad groups?",
              "Which targets underperformed, and why?"
            ]
          },
          {
            "category": "Insights and Learnings",
            "questions": [
              "What customer search terms drove the most conversions?",
              "What insights can be gained from the campaign’s performance data?",
              "How will these insights inform future campaigns?"
            ]
          },
          {
            "category": "Impact Assessment",
            "questions": [
              "What was the overall impact on the product's sales velocity, ranking, and reviews?",
              "Did the campaign help achieve broader business objectives (e.g., increased market share, competitive positioning)?",
              "What adjustments should be made for future Sponsored Product campaigns?"
            ]
          }
        ]
      }
    ]
  }
  