{
    "template_name": "Fiction Book Author Playbook",
    "sections": [
      {
        "section_name": "Book Definition",
        "details": [
          {
            "category": "Core Concept and Purpose",
            "questions": [
              "What is the central idea or theme of my story?",
              "Why do I want to write this book, and what impact do I hope it will have on readers?",
              "What makes my story unique or worth telling?"
            ]
          },
          {
            "category": "Audience",
            "questions": [
              "Who is my target audience, and what are their expectations?",
              "What genre does my story belong to, and how does it align with or challenge conventions in that genre?"
            ]
          },
          {
            "category": "Characters",
            "questions": [
              "Who is my protagonist, and what do they want or need most in the story?",
              "What are my character's strengths, flaws, and motivations?",
              "Who or what opposes my protagonist, and why?",
              "How will my characters grow or change throughout the story?"
            ]
          },
          {
            "category": "Setting",
            "questions": [
              "Where and when does my story take place, and how does this setting shape the narrative?",
              "What unique details or features of the setting can enhance the story’s mood and themes?"
            ]
          },
          {
            "category": "Plot and Structure",
            "questions": [
              "What is the central conflict driving the story?",
              "What key events or turning points will shape the plot?",
              "How will the story begin, develop, and end?",
              "What stakes or consequences will keep readers engaged?"
            ]
          },
          {
            "category": "Themes and Messages",
            "questions": [
              "What deeper themes or messages do I want to explore in this story?",
              "How can I convey these themes subtly without preaching to the audience?"
            ]
          },
          {
            "category": "Style and Voice",
            "questions": [
              "What tone or mood do I want my story to convey?",
              "What narrative perspective (e.g., first-person, third-person) and voice best suit the story?"
            ]
          },
          {
            "category": "Conflict and Stakes",
            "questions": [
              "What are the internal and external conflicts my protagonist faces?",
              "What are the stakes if the protagonist fails or succeeds?"
            ]
          },
          {
            "category": "Engagement and Pacing",
            "questions": [
              "How will I capture readers' attention from the start?",
              "How can I maintain tension and momentum throughout the story?"
            ]
          },
          {
            "category": "Resolution and Ending",
            "questions": [
              "What resolution do I want to provide, and does it align with the story's themes?",
              "How do I want readers to feel when they finish the book?"
            ]
          },
          {
            "category": "Practical Considerations",
            "questions": [
              "What research or preparation do I need to do to make the story authentic?",
              "How much time and effort can I realistically dedicate to writing this book?"
            ]
          }
        ]
      },
      {
        "section_name": "Chapter Definition",
        "details": [
          {
            "category": "Purpose of the Chapter",
            "questions": [
              "What role does this chapter play in the overall story?",
              "How does this chapter move the plot forward or develop characters?"
            ]
          },
          {
            "category": "Chapter Objectives",
            "questions": [
              "What specific event, revelation, or conflict should occur in this chapter?",
              "What emotions or reactions do I want to evoke from readers in this chapter?"
            ]
          },
          {
            "category": "Characters and Interactions",
            "questions": [
              "Which characters are involved in this chapter, and what are their goals?",
              "How do the character interactions in this chapter reveal growth, conflict, or relationships?"
            ]
          },
          {
            "category": "Setting",
            "questions": [
              "Where does this chapter take place, and how does the setting enhance the story's mood or themes?",
              "What sensory details can make the setting more vivid and engaging?"
            ]
          },
          {
            "category": "Conflict and Stakes",
            "questions": [
              "What conflicts or obstacles arise in this chapter?",
              "How do these conflicts tie into the larger narrative or character arcs?"
            ]
          },
          {
            "category": "Pacing and Engagement",
            "questions": [
              "How does this chapter balance action, dialogue, and introspection?",
              "What hooks or cliffhangers can I use to keep readers invested?"
            ]
          },
          {
            "category": "Connection to the Story",
            "questions": [
              "How does this chapter connect to the previous and subsequent chapters?",
              "Does this chapter introduce any foreshadowing or setups for later events?"
            ]
          },
          {
            "category": "Resolution",
            "questions": [
              "Does this chapter resolve any ongoing conflicts or questions?",
              "How does the chapter's ending transition smoothly to the next part of the story?"
            ]
          }
        ]
      }
    ]
  }
  